Revit 2027 API
IFCExportOptions.FileVersion Property
 IFC file version.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCVersion FileVersion { get; set; }
Public Property FileVersion As IFCVersion
	Get
	Set
public:
property IFCVersion FileVersion {
	IFCVersion get ();
	void set (IFCVersion value);
}
member FileVersion : IFCVersion with get, set
Property Value
IFCVersion
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Default is IFCVersion.Default.
See Also
Reference
IFCExportOptions Class
Autodesk.Revit.DB Namespace